{
  "basics": {
    "name": "Petar Prole",
    "website": "https://github.com/perororo",
    "label": "Senior Software Engineer",
    "summary": [
      "Senior Software Engineer with 10+ years of experience developing enterprise applications for major clients including Audi, BMW, Volkswagen, Unicredit, and Bosch. Specialized in technologies such as Java, Kotlin, Spring Boot, React and Angular with extensive experience in microservices architecture, legacy system modernization, and cloud platforms.",
      "Led development teams across banking, automotive, and logistics sectors, including real-time auction platforms, EDI solutions, and IoT applications. Expertise in implementing hexagonal architecture, Domain-Driven Design, and managing complex system integrations while ensuring compliance and regulatory standards.",
      "Proven ability to work directly with stakeholders, conduct Event Storming sessions, and translate business requirements into scalable technical solutions. Experience mentoring development teams, managing release cycles, and maintaining production systems with high availability requirements adhering to the highest security standards.",
      "As the owner and main consultant of jimp doo I am providing enterprise software engineering services with focus on microservices architecture, cloud-native solutions, and system modernization for international clients."
    ],
    "phone": "+385959055376",
    "email": "petarprole@gmail.com",
    "picture": true,
    "location": {
      "postalCode": "51557",
      "city": "Cres",
      "countryCode": "CRO"
    }
  },
  "work": [
    {
      "company": "jimp doo",
      "position": "Owner",
      "startDate": "November 2024",
      "endDate": "",
      "employment": "Full-time",
      "summary": "Founder and principal consultant of jimp doo, delivering full-stack software engineering services to enterprise clients. Specialize in designing cloud-native, event-driven, and resilient backend systems while supporting cross-functional teams through hands-on leadership and technical mentorship.",
      "highlights": [
        "Founded a consultancy focused on scalable, domain-driven software architecture",
        "Delivered cloud-native solutions using Java, Kotlin, Spring Boot, and React",
        "Led architecture and implementation of secure, containerized microservices on AWS and OpenShift",
        "Established robust CI/CD pipelines and DevOps workflows for clients",
        "Facilitated event storming workshops and defined domain boundaries for new product initiatives",
        "Mentored developers on clean architecture, test automation, and system design",
        "Managed client relationships and project roadmaps end-to-end"
      ]
    },
    {
      "company": "Comsysto Reply GmbH",
      "website": "https://comsystoreply.de",
      "position": "Senior Developer",
      "startDate": "May 2017",
      "endDate": "November 2024",
      "employment": "Full-time",
      "summary": "I worked on diverse projects across various industries, collaborating with stakeholders to gather requirements, refine them into actionable user stories, and implement features following industry best practices. My role emphasized maintaining system integrity, fostering knowledge exchange across teams, and breaking down complex topics through events like event storming. I contributed to multiple projects ranging from modernizing legacy systems for banks, creating state of the art logistic solutions for Automotive giants and working on realtime Car Auction platforms, to name a few. Leveraging technologies such as Kotlin, Spring Boot, and AWS, I ensured solutions were scalable, reliable, and adhered to clean code principles.",
      "highlights": [
        "Supported backend development with a focus on networking and containerized environments",
        "Focused on streamlining development and ensuring system stability",
        "Addressed challenges in maintaining clean code, applying TDD, and ensuring seamless integration and delivery",
        "Ensured scalability and maintainability while following best practices in feature implementation",
        "Maintained architectural integrity and optimized service communication within Azure and AWS-hosted environments",
        "Overcame legacy system constraints in Java-based applications hosted on IBM WebSphere",
        "Addressed integration challenges in a structured monolith environment with external service communication",
        "Solved complexities in a microservice architecture using standards for EDI communication",
        "Tackled IoT-specific challenges, including device connectivity"
      ]
    },
    {
      "company": "TIS GRUPA d.o.o.",
      "website": "https://tis-grupa.com/en/",
      "position": "Junior Developer",
      "startDate": "November 2015",
      "endDate": "May 2017",
      "employment": "Full-time",
      "summary": "I contributed to the development and maintenance of financial and banking applications, focusing on SEPA compliance and transaction processing. My responsibilities included creating SQL procedures, developing front-end and back-end modules, implementing REST APIs, and ensuring data integrity through robust validation processes. I collaborated with senior developers to deliver new features and provided ongoing customer support to ensure seamless application functionality.",
      "highlights": [
        "Developed and maintained modules for financial transaction processing, including REST APIs and front-end interfaces",
        "Implemented SQL procedures, data migrations, and persistence jobs to comply with SEPA regulations",
        "Addressed challenges in XML transaction packaging, input validation, and ensuring seamless user functionality in banking systems"
      ]
    }
  ],
  "education": [
    {
      "institution": "Polytechnic of Rijeka",
      "courses": [
        "graduation thesis: Mining of unstructured data"
      ],
      "area": "Professional Specialist in Business IT System",
      "startDate": "Oct 2013",
      "endDate": "Sep 2015"
    },
    {
      "institution": "Polytechnic of Rijeka",
      "courses": [
        "graduation thesis: Scalability of high load applications: Social networks"
      ],
      "area": "Bachelor of Computer Science",
      "startDate": "Oct 2009",
      "endDate": "Sep 2013"
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "keywords": [
        "Java",
        "Kotlin",
        "TypeScript",
        "SQL",
        "Bash"
      ]
    },
    {
      "name": "Frameworks & Libraries",
      "keywords": [
        "Spring Boot",
        "Spring Data",
        "Spring Security",
        "Angular",
        "jQuery",
        "React"
      ]
    },
    {
      "name": "Testing",
      "keywords": [
        "JUnit",
        "SpringTest",
        "ArchUnit",
        "Cucumber",
        "Gatling",
        "JMeter"
      ]
    },
    {
      "name": "Databases",
      "keywords": [
        "MySQL",
        "PostgreSQL",
        "MongoDB"
      ]
    },
    {
      "name": "Architectures",
      "keywords": [
        "Microservices Architecture",
        "Hexagonal Architecture",
        "Monolith-to-Microservice Transition"
      ]
    },
    {
      "name": "Event-Driven Systems",
      "keywords": [
        "Kafka",
        "RabbitMQ"
      ]
    },
    {
      "name": "Tools & Platforms",
      "keywords": [
        "Jenkins",
        "GitLab CI/CD",
        "Docker",
        "Kubernetes",
        "AWS",
        "Azure"
      ]
    },
    {
      "name": "Practices",
      "keywords": [
        "Test-Driven Development",
        "Pair Programming",
        "Clean Code Principles",
        "Unit Testing",
        "Integration Testing",
        "Performance Testing",
        "Domain-Driven Design",
        "Trunk based development"
      ]
    },
    {
      "name": "APIs",
      "keywords": [
        "RESTful Services",
        "XML",
        "JSON"
      ]
    }
  ],
  "publications": [],
  "projects": [
    {
      "company": "jimp",
      "name": "Car credit and loan platform",
      "description": "Developing multiple services related to car credits using microservice architecture with Java and Spring in the backend and React in the frontend. OpenShift is used to manage the workloads, whilst Jenkins is used as the pipeline for the services.<br><br><strong>Key responsibilities included:</strong><br>• enhance system security and scalability<br>• maintaining existing functionality, whilst trying to improve current codebase<br>• developing features for missing products<br>• ownership of tasks from development to production",
      "keywords": "Java, Spring, Microservices, OpenShift, React, Jenkins",
      "roles": "Senior Developer"
    },
    {
      "company": "Comsysto @Audi Used Car Platform",
      "name": "Used Car Auction Platform",
      "website": "https://www.audi.co.uk/en/used-car-search/",
      "description": "Developed a platform enabling Audi to auction used cars to dealers. The application follows a structured monolith setup with components written in Kotlin and Java, and integrates with two external services.<br><br><strong>Key responsibilities included:</strong><br>• encapsulate business logic within the domain of the application<br>• decouple application<br>• generify commonly repeated tasks<br>• work with the stakeholders to better define the scopes and the goal<br>• oversea a group of junior colleagues<br>• developing features for missing products<br>• release management",
      "keywords": "Kotlin, Java, Monolith Architecture, AWS, Domain-Driven Design, React",
      "roles": "Senior Developer"
    },
    {
      "company": "Comsysto @RIO | The Logistics Flow",
      "name": "Electronic Data Interchange",
      "website": "https://www.rio.cloud",
      "description": "Built and maintained a microservice-based EDI solution for logistics communication between VW, suppliers, and shippers. Each service adhered to hexagonal architecture and was implemented in Kotlin, hosted on AWS with logical account separation.<br><br><strong>Key responsibilities included:</strong><br>• Develop solutions for highly complex business cases<br>• Work across multiple teams to disperse knowledge<br>• Automate processes<br>• Hold presentations about decisions taken and lessons learned<br>• Work closely with stakeholders and other teams to create a Ubiquitous Language<br>• Partake in Event Stormings",
      "keywords": "Kotlin, AWS, Hexagonal Architecture, ArchUnit, Microservices, React, Trunk based development, Pair programming",
      "roles": "Senior Developer"
    },
    {
      "company": "Comsysto @Unicredit",
      "name": "Application Maintenance and Development",
      "website": "https://www.unicreditgroup.eu",
      "description": "Managing and maintaining three services on IBM Web Sphere. Responsibilities included client communication, gathering requirements, developing features, and ensuring application maintenance.<br><br><strong>Key responsibilities included:</strong><br>• directly available to users for troubleshooting problems<br>• directly responsible for 4 core services of the bank<br>• mentor junior colleague",
      "keywords": "Java, IBM Web Sphere, Client Communication, Feature Development, Pair programming",
      "roles": "Senior Developer"
    },
    {
      "company": "Comsysto @Device Insight/Bosch",
      "name": "mec-remote IoT Application",
      "website": "https://www.bosch-industrial.com/global/en/ocs/commercial-industrial/remote-access-mec-remote-669574-p/",
      "description": "Developed backend features for an IoT application enabling technicians to access and manage industrial heating devices. Split monolith into microservices, implemented networking solutions with OpenVPN, containerized the services and moved some of them to Azure.<br><br><strong>Key responsibilities included:</strong><br>• take over application from creator<br>• meet QA expectations to make application production ready<br>• develop new features<br>• directly responsible to users",
      "keywords": "Jetty, Spring Boot, Node.js, OpenVPN, Azure, Microservices, Pair Programming",
      "roles": "Backend Developer"
    },
    {
      "company": "Comsysto @Consorsbank",
      "name": "Web Modernization",
      "website": "https://www.consorsbank.de",
      "description": "Modernized an existing web platform using Angular and Spring Boot 2.x. Focused on backend development, microservices, and CI/CD pipelines while supporting releases and maintenance.<br><br><strong>Key responsibilities included:</strong><br>• Implement service security<br>• Implement new features for products<br>• Support<br>• Closely work with QA to set testing benchmarks",
      "keywords": "Java 8, Spring Boot, Angular 5, CI/CD, TDD, Pair Programming",
      "roles": "Backend Developer"
    },
    {
      "company": "Comsysto @BMW",
      "name": "Customer Features Presentation",
      "website": "https://www.bmw.com",
      "description": "Reconfigured Spring implementation and refactored code to make a single-page application production-ready for BMW. Introduced JPA, transactional calls, and wrote batch jobs.<br><br><strong>Key responsibilities included:</strong><br>• Help team get application production ready<br>• Designed and implemented transaction management using Spring to ensure ACID principles across critical operations",
      "keywords": "Java, Spring Boot, JPA, Bash, Vaadin, Testing, Code Refactoring",
      "roles": "Developer"
    },
    {
      "company": "TIS OIS",
      "name": "SEPA Direct Debit Module",
      "website": "https://www.tis.hr",
      "description": "Created SQL procedures and implemented tables and jobs to support SEPA direct debit compliance for a core banking application.",
      "keywords": "SQL, Database Design, Data Migration, SEPA Compliance",
      "roles": "Database Developer"
    },
    {
      "company": "TIS OIS",
      "name": "R-Transactions Module",
      "website": "https://www.fina.hr/eng/financial-services-and-payment-systems/non-cash-payment-transaction/sepa",
      "description": "Developed a module to handle R-transactions for FINA, including front-end, back-end, repositories, REST endpoints, and jQuery-based UI. Maintained and bug-fixed the application during testing.",
      "keywords": "Java, REST, jQuery, Module Development, Bug Fixing",
      "roles": "Full-Stack Developer"
    },
    {
      "company": "TIS OIS",
      "name": "Single Euro Payment Area (SEPA) System",
      "website": "https://www.fina.hr/eng/financial-services-and-payment-systems/non-cash-payment-transaction/sepa",
      "description": "Developed a module for banking systems to package user transactions into XML with validation. Delivered new functionalities and handled daily customer support.",
      "keywords": "Java, XML, Transaction Validation, Customer Support",
      "roles": "Developer"
    }
  ],
  "languages": [
    {
      "language": "Croatian",
      "fluency": "Native"
    },
    {
      "language": "German",
      "fluency": "Full professional proficiency"
    },
    {
      "language": "English",
      "fluency": "Full professional proficiency"
    }
  ]
}
